# Solution Task

Feature Engineering

In [ ]:
import pandas as pd

row_1 = {'City': 'Alex', 'Pop': 655500 , 'Area' : 2500}    # Column name and value
row_2 = {'City': 'Mecca', 'Pop': 254400 , 'Area' : 9820}    # Column name and value


data = pd.DataFrame([row_1, row_2])
data

    City     Pop  Area
0   Alex  655500  2500
1  Mecca  254400  9820

In [ ]:
data['Density'] =  data['Pop'] / data['Area']
data

    City     Pop  Area     Density
0   Alex  655500  2500  262.200000
1  Mecca  254400  9820   25.906314

This shows a preview of the straightforward syntax of element-by-element arithmetic between ``Series`` objects; we'll dig into this further in [Operating on Data in Pandas](03.03-Operations-in-Pandas.ipynb).

With this picture in mind, many familiar array-like observations can be done on the ``DataFrame`` itself.
For example, we can transpose the full ``DataFrame`` to swap rows and columns:

In [ ]:
data.T #transpose

              0          1
City       Alex      Mecca
Pop      655500     254400
Area       2500       9820
Density   262.2  25.906314

When it comes to indexing of ``DataFrame`` objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array.
In particular, passing a single index to an array accesses a row:

In [ ]:
data

    City     Pop  Area     Density
0   Alex  655500  2500  262.200000
1  Mecca  254400  9820   25.906314

In [ ]:
data['Area']

0    2500
1    9820
Name: Area, dtype: int64

**Task**

Create Dataframe with 5 rows with 3 columns  

1- first column names of students

2- second column is age of them

3- GPA

what to do ?

    1- create new column with multiply age by 5

**Bonus**

    2- make columns name is index
    3- call any student by his name to print rest of data

In [ ]:
import pandas as pd

In [ ]:
row_1 = {'Name': 'Ahmed',   'Age': 25 , 'GPA' : 4}    # Column name and value
row_2 = {'Name': 'Mahmoud', 'Age': 43 , 'GPA' : 2.5}    # Column name and value
row_3 = {'Name': 'Sara',    'Age': 33 , 'GPA' : 3}

data = pd.DataFrame([row_1, row_2,row_3])
data

      Name  Age  GPA
0    Ahmed   25  4.0
1  Mahmoud   43  2.5
2     Sara   33  3.0

In [ ]:
data

      Name  Age  GPA
0    Ahmed   25  4.0
1  Mahmoud   43  2.5
2     Sara   33  3.0

In [ ]:
data['age5'] = data['Age'] * 5
data

      Name  Age  GPA  age5
0    Ahmed   25  4.0   125
1  Mahmoud   43  2.5   215
2     Sara   33  3.0   165

In [ ]:
data.set_index('Name',inplace=True)

In [ ]:
data

         Age  GPA  age5
Name
Ahmed     25  4.0   125
Mahmoud   43  2.5   215
Sara      33  3.0   165

In [ ]:
data.loc['Mahmoud']

Age      43.0
GPA       2.5
age5    215.0
Name: Mahmoud, dtype: float64